# Rebar Container Append Item From Curves And Shape(Rebar Shape, Rebar Bar Type, Rebar Hook Type, Rebar Hook Type, XYZ, IList Curve , Rebar Termination Orientation, Rebar Termination Orientation) Method

Source: https://www.revitapidocs.com/2026/02e34460-f53b-3cd1-71ba-74232d66080b.htm

---

| Rebar Container Append Item From Curves And Shape(Rebar Shape, Rebar Bar Type, Rebar Hook Type, Rebar Hook Type, XYZ, IList Curve , Rebar Termination Orientation, Rebar Termination Orientation) Method |
| --- |

**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public RebarContainerItem AppendItemFromCurvesAndShape(
	RebarShape rebarShape,
	RebarBarType barType,
	RebarHookType startHook,
	RebarHookType endHook,
	XYZ normal,
	IList<Curve> curves,
	RebarTerminationOrientation startHookOrient,
	RebarTerminationOrientation endHookOrient
)
```

```
Public Function AppendItemFromCurvesAndShape (
	rebarShape As RebarShape,
	barType As RebarBarType,
	startHook As RebarHookType,
	endHook As RebarHookType,
	normal As XYZ,
	curves As IList(Of Curve),
	startHookOrient As RebarTerminationOrientation,
	endHookOrient As RebarTerminationOrientation
) As RebarContainerItem
```

```
public:
RebarContainerItem^ AppendItemFromCurvesAndShape(
	RebarShape^ rebarShape,
	RebarBarType^ barType,
	RebarHookType^ startHook,
	RebarHookType^ endHook,
	XYZ^ normal,
	IList<Curve^>^ curves,
	RebarTerminationOrientation startHookOrient,
	RebarTerminationOrientation endHookOrient
)
```

```
member AppendItemFromCurvesAndShape :
        rebarShape : RebarShape *
        barType : RebarBarType *
        startHook : RebarHookType *
        endHook : RebarHookType *
        normal : XYZ *
        curves : IList<Curve> *
        startHookOrient : RebarTerminationOrientation *
        endHookOrient : RebarTerminationOrientation -> RebarContainerItem
```

#### Parameters

rebarShape RebarShape
barType RebarBarType
startHook RebarHookType
endHook RebarHookType
normal XYZ
curves IList Curve
startHookOrient RebarTerminationOrientation
endHookOrient RebarTerminationOrientation

#### Return Value

RebarContainerItem See Also

#### Reference

RebarContainer Class AppendItemFromCurvesAndShape Overload Autodesk.Revit.DB.Structure Namespace